[
  "Splicing of mammalian precursor transfer RNA (tRNA) molecules involves two enzymatic steps. First, intron removal by the tRNA splicing endonuclease generates separate 5' and 3' exons. In animals, the second step predominantly entails direct exon ligation by an elusive RNA ligase. Using activity-guided purification of tRNA ligase from HeLa cell extracts, we identified HSPC117, a member of the UPF0027 (RtcB) family, as the essential subunit of a tRNA ligase complex. RNA interference-mediated depletion of HSPC117 inhibited maturation of intron-containing pre-tRNA both in vitro and in living cells. The high sequence conservation of HSPC117/RtcB proteins is suggestive of RNA ligase roles of this protein family in various organisms.",
  "All genomes have mobile genetic segments called transposable elements (TEs). Here we describe a system, which we term SOS splicing, that protects Caenorhabditis elegans and human genes against DNA-transposon-mediated disruption by excising these TEs from host mRNAs. SOS splicing, which seems to operate independently of the spliceosome, is a pattern-recognition system triggered by the base-pairing of inverted terminal repeat elements, which are a defining feature of DNA transposons. We identify three factors required for SOS splicing in both C. elegans and human cells: AKAP17A, which binds TE-containing mRNAs; the RNA ligase RTCB; and CAAP1, which bridges RTCB and AKAP17A to allow RTCB to ligate mRNA fragments generated by TE excision. We propose that SOS splicing is a previously undescribed conserved and RNA-structure-directed mode of mRNA splicing, and that an identified function of SOS splicing is to genetically buffer animals from the deleterious effects of DNA-transposon-mediated gene perturbation.",
  "RNA cleavage by some endoribonucleases and self-cleaving ribozymes produces RNA fragments with 5'-hydroxyl (5'-OH) and 2',3'-cyclic phosphate termini. To identify 5'-OH RNA fragments produced by these cleavage events, we exploited the unique ligation mechanism of Escherichia coli RtcB RNA ligase to attach an oligonucleotide linker to RNAs with 5'-OH termini, followed by steps for library construction and analysis by massively parallel DNA sequencing. We applied the method to RNA from budding yeast and captured known 5'-OH fragments produced by tRNA Splicing Endonuclease (SEN) during processing of intron-containing pre-tRNAs and by Ire1 cleavage of HAC1 mRNA following induction of the unfolded protein response (UPR). We identified numerous novel 5'-OH fragments derived from mRNAs: some 5'-OH mRNA fragments were derived from single, localized cleavages, while others were likely produced by multiple, distributed cleavages. Many 5'-OH fragments derived from mRNAs were produced upstream of codons for highly electrostatic peptides, suggesting that the fragments may be generated by co-translational mRNA decay. Several 5'-OH RNA fragments accumulated during the induction of the UPR, some of which share a common sequence motif that may direct cleavage of these mRNAs. This method enables specific capture of 5'-OH termini and complements existing methods for identifying RNAs with 2',3'-cyclic phosphate termini.",
  "Ribozymes are small catalytic RNA sequences capable of nucleotide-specific self-cleavage found widespread in nature. Ribozyme cleavage generates distinct 2',3'-phosphate and 5'-hydroxyl termini that resemble substrates for recently characterized RNA repair pathways in cells. We report that ribozyme cleavage of two separate mRNAs activated their scarless trans-ligation and translation into full-length protein in eukaryotic cells, a process that we named StitchR (for Stitch RNA). Optimization of StitchR activity in mammalian cells resulted in a ~900-fold increase in protein expression that approached levels observed for genes expressed from single vectors. We demonstrate that StitchR can be harnessed for effective dual adeno-associated virus gene therapies to correct muscular dystrophies by restoring large functional muscle proteins to endogenous levels in vivo.",
  "Compelling evidence indicates that the CRISPR-Cas system protects prokaryotes from viruses and other potential genome invaders. This adaptive prokaryotic immune system arises from the clustered regularly interspaced short palindromic repeats (CRISPRs) found in prokaryotic genomes, which harbor short invader-derived sequences, and the CRISPR-associated (Cas) protein-coding genes. Here, we have identified a CRISPR-Cas effector complex that is comprised of small invader-targeting RNAs from the CRISPR loci (termed prokaryotic silencing (psi)RNAs) and the RAMP module (or Cmr) Cas proteins. The psiRNA-Cmr protein complexes cleave complementary target RNAs at a fixed distance from the 3' end of the integral psiRNAs. In Pyrococcus furiosus, psiRNAs occur in two size forms that share a common 5' sequence tag but have distinct 3' ends that direct cleavage of a given target RNA at two distinct sites. Our results indicate that prokaryotes possess a unique RNA silencing system that functions by homology-dependent cleavage of invader RNAs."
]
